21-rails-auth/app/controllers/sessions_controller.rb

  def create #POST request '/login'
    # handle the submission form our login form
    # log the user in

    # see if we have a user with the provided username
    @user = User.find_by(username: params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "randy"], ["LIMIT", 1]]