21-rails-auth/app/controllers/users_controller.rb

  def create #POST request to /users FOR SIGNUP
    # byebug
    @user = User.create(user_params) # User.create is a method on our MODEL which will encrypt and store the user's plaintext password
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "a"], ["password_digest", "$2a$10$CGgUH4WMtxnMlfDyuSlKt.UlkL41WwGYoS/goQX/M0YVS5PUsoTBa"], ["created_at", "2019-12-04 19:03:08.743113"], ["updated_at", "2019-12-04 19:03:08.743113"]]